environment/captain_challenge/app/controllers/combattants_controller.rb

  def index
    @combattants = Combattant.all
---
SELECT "combattants".* FROM "combattants"

  def create
    @combattant = Combattant.new(combattant_params)

    respond_to do |format|
      if @combattant.save
---
INSERT INTO "combattants" ("nom", "points_de_vie", "points_d_attaque", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nom", "MyString"], ["points_de_vie", 90], ["points_d_attaque", 16], ["created_at", "2019-02-16 15:02:49.847325"], ["updated_at", "2019-02-16 15:02:49.847325"]]

  def update
    respond_to do |format|
      if @combattant.update(combattant_params)
---
UPDATE "combattants" SET "points_de_vie" = ?, "points_d_attaque" = ?, "updated_at" = ? WHERE "combattants"."id" = ?  [["points_de_vie", 95], ["points_d_attaque", 17], ["updated_at", "2019-02-16 15:04:09.326292"], ["id", 980190962]]

  def destroy
    @combattant.destroy
---
DELETE FROM "combattants" WHERE "combattants"."id" = ?  [["id", 980190962]]

    def set_combattant
      @combattant = Combattant.find(params[:id])
---
SELECT  "combattants".* FROM "combattants" WHERE "combattants"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]