environment/captain_challenge/app/controllers/players_controller.rb

INSERT INTO "players" ("name", "life_points", "attack_points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["life_points", 1], ["attack_points", 1], ["created_at", "2019-02-15 12:01:03.125937"], ["updated_at", "2019-02-15 12:01:03.125937"]]
---
  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save

DELETE FROM "players" WHERE "players"."id" = ?  [["id", 980190962]]
---
  def destroy
    @player.destroy